app/controllers/todos_controller.rb

  def index
    @todos = Todo.all
---
SELECT * FROM "todos"

  def show
    @todo = Todo.find(params[:id])
---
SELECT * FROM "todos" WHERE ("todos"."id" = 1)

  def edit
    @todo = Todo.find(params[:id])
---
SELECT * FROM "todos" WHERE ("todos"."id" = 4)

  def create
    @todo = Todo.new(params[:todo])
    @todo.d_entry = Time.now
    @todo.d_update = ''
    @todo.d_close = ''

    respond_to do |format|
      if @todo.save
---
INSERT INTO "todos" ("d_close", "updated_at", "title", "d_update", "d_entry", "content", "created_at") VALUES('2009-09-04 03:18:00', '2009-09-04 03:19:09', 'ToDoアプリケーションの作成', '2009-09-04 03:18:00', '2009-09-04 03:18:00', 'Ruby on Railsを活用してToDoアプリケーションを作成する', '2009-09-04 03:19:09')

  def update
    @todo = Todo.find(params[:id])

    respond_to do |format|
      params[:todo][:d_update] = Time.now
      if params[:f_close]
        params[:todo][:d_close] = Time.now
      else
        params[:todo][:d_close] = ''
      end
      if @todo.update_attributes(params[:todo])
---
SELECT * FROM "todos" WHERE ("todos"."id" = 4)
UPDATE "todos" SET "d_close" = '2009-09-29 17:43:42', "d_entry" = '2009-09-04 10:29:58', "d_update" = '2009-09-29 17:43:42', "updated_at" = '2009-09-29 17:43:42' WHERE "id" = 2

  def destroy
    @todo = Todo.find(params[:id])
    @todo.destroy
---
SELECT * FROM "todos" WHERE ("todos"."id" = 1)
DELETE FROM "todos" WHERE "id" = 1